       IDENTIFICATION DIVISION.
       PROGRAM-ID. TAREA2.
       AUTHOR. DIEGO-BARRERA-MUÑOZ.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       	SELECT NOMBRES ASSIGN TO DISK
       	ORGANIZATION IS LINE SEQUENTIAL.
       	SELECT NOMBRES1 ASSIGN TO DISK
       	ORGANIZATION IS RELATIVE
       	ACCESS MODE IS DYNAMIC
       	RELATIVE KEY IS RUT3.
       	SELECT NOMBRES2 ASSIGN TO DISK
       	ORGANIZATION IS LINE SEQUENTIAL.
       	SELECT NOMBRES-ORD ASSIGN TO DISK
       	ORGANIZATION IS LINE SEQUENTIAL.
       	SELECT TEMPO ASSIGN TO SORT.
       DATA DIVISION.
       FILE SECTION.
       FD NOMBRES
       	LABEL RECORD IS STANDARD
       	VALUE OF FILE-ID "PERSONAS.TXT".
       01 REG-NOM.
       	02 RUT.
       		03 RUTA		PIC 9(4).
       		03 RUTB		PIC 9(4).
       	02 DV			PIC X.
       	02 APELLIDOA	PIC X(16).
       	02 APELLIDOB	PIC X(16).
       	02 NOMBRE		PIC X(32).
       	02 FECHAN.
       		03 ANO		PIC 9999.
       		03 MES		PIC 99.
       		03 DIA		PIC 99.
       	02 SEXO			PIC X.
       FD NOMBRES1
       	LABEL RECORD IS STANDARD
       	VALUE OF FILE-ID "NOMBRES1.DAT".
       01 REG-NOM1.
       	02 RUT1.
       		03 RUTA1	PIC 9(4).
       		03 RUTB1	PIC 9(4).
       	02 DV1			PIC X.
       	02 APELLIDOA1	PIC X(16).
       	02 APELLIDOB1	PIC X(16).
       	02 NOMBRE1		PIC X(32).
       	02 FECHAN1.
       		03 ANO1		PIC 9999.
       		03 MES1		PIC 99.
       		03 DIA1		PIC 99.
       	02 SEXO1		PIC X.
       FD NOMBRES2
       	LABEL RECORD IS STANDARD
       	VALUE OF FILE-ID "NOMBRES2.DAT".
       01 REG-NOM2.
       	02 RUT2.
       		03 RUTA2	PIC 9(4).
       		03 RUTB2	PIC 9(4).
       	02 DV2			PIC X.
       	02 APELLIDOA2	PIC X(16).
       	02 APELLIDOB2	PIC X(16).
       	02 NOMBRE2		PIC X(32).
       	02 FECHAN2.
       		03 ANO2		PIC 9999.
       		03 MES2		PIC 99.
       		03 DIA2		PIC 99.
       	02 SEXO2		PIC X.
       FD NOMBRES-ORD
       	LABEL RECORD IS STANDARD
       	VALUE OF FILE-ID "ORDENA.TXT".
       01 REG-NOM-ORD.
       	02 RUT-ORD.
       		03 RUTA-ORD		PIC 9(4).
       		03 RUTB-ORD		PIC 9(4).
       	02 DV-ORD			PIC X.
       	02 APELLIDOA-ORD	PIC X(16).
       	02 APELLIDOB-ORD	PIC X(16).
       	02 NOMBRE-ORD		PIC X(32).
       	02 FECHAN-ORD.
       		03 ANO-ORD		PIC 9999.
       		03 MES-ORD		PIC 99.
       		03 DIA-ORD		PIC 99.
       	02 SEXO-ORD			PIC X.
       SD TEMPO.
       01 REG-NOM-TEMP.
       	02 RUT-TEMP.
       		03 RUTA-TEMP		PIC 9(4).
       		03 RUTB-TEMP		PIC 9(4).
       	02 DV-TEMP			PIC X.
       	02 APELLIDOA-TEMP	PIC X(16).
       	02 APELLIDOB-TEMP	PIC X(16).
       	02 NOMBRE-TEMP		PIC X(32).
       	02 FECHAN-TEMP.
       		03 ANO-TEMP		PIC 9999.
       		03 MES-TEMP		PIC 99.
       		03 DIA-TEMP		PIC 99.
       	02 SEXO-TEMP			PIC X.
       WORKING-STORAGE SECTION.
       77 INDICE		PIC 9(6).
       77 RUT3			PIC 9(4).
       77 MESN			PIC 99.
       77 DIAN			PIC 99.
       77 APE-ING		PIC X(16).
       01 RUT-ING.
        	02 R1					PIC 9.
        	02 R2					PIC 9.
        	02 R3					PIC 9.
        	02 R4					PIC 9.
        	02 R5					PIC 9.
        	02 R6					PIC 9.
        	02 R7					PIC 9.
        	02 R8					PIC 9.
       77 DV-I					PIC X.
       77 SUMA-RUT				PIC 9(5) VALUE 0.
       77 SUMA-RUT1				PIC 9(5) VALUE 0.
       77 SUMA-RUT2				PIC 9(5) VALUE 0.
       77 RESULTADO-RUT			PIC 9(5) VALUE 0.
       77 MODULO-RUT			PIC 99 VALUE 0.
       77 DV-CALC				PIC X.
       77 N						PIC X.
       77 MODULO-RESTA			PIC 99 VALUE 0.
       77 OP					PIC 9.
       77 ARCH					PIC 9.
       77 ORDD					PIC 9.
       77 SN					PIC X.
       PROCEDURE DIVISION.
       ABRIR1.
       		OPEN INPUT NOMBRES
       		OPEN OUTPUT NOMBRES1 NOMBRES2.
       LEER-GRABA.
       		READ NOMBRES AT END GO TO MENU-PRINCIPAL.
       		MOVE RUTB TO RUT3
       		MOVE REG-NOM TO REG-NOM1
       		WRITE REG-NOM1
       		INVALID KEY
       		MOVE REG-NOM TO REG-NOM2
       		WRITE REG-NOM2
       		GO TO LEER-GRABA
       		NOT INVALID KEY
       		GO TO LEER-GRABA
       		END-WRITE.
       MENU-PRINCIPAL.
       		DISPLAY SPACE LINE 1 COL 1 ERASE
       		DISPLAY "MENU PRINCIPAL" LINE 2 COL 20
       		DISPLAY "AGREGAR_REGISTRO.............OPCION [1]" 
       		LINE 4 COL 2
       		DISPLAY "BUSCAR_REGISTRO_POR_RUT......OPCION [2]" 
       		LINE 5 COL 2
       		DISPLAY "LISTAR_REGISTRO_POR_APELLIDO.OPCION [3]" 
       		LINE 6 COL 2
       		DISPLAY "LISTAR_REGISTRO_POR_RUT......OPCION [4]"
       		LINE 7 COL 2
       		DISPLAY "SALIR........................OPCION [5]"
       		LINE 8 COL 2
       		DISPLAY "En Caso De Listar Seleccione Orden"
       		LINE 15 COL 2
       		DISPLAY "Ascendente(1) Descendente(2): (   )"
       		LINE 16 COL 2
       		DISPLAY "Seleccione Archivos a Usar" LINE 12 COL 2
       		DISPLAY "NOMBRES1(1) NOMBRES2(2) AMBOS(3): (   )"
       		LINE 13 COL 2
       		DISPLAY "Ingrese Una Opcion: (   )" LINE 10 COL 2
       		ACCEPT OP LINE 10 COL 24
       		PERFORM UNTIL OP = 3 OR OP = 2 
       			OR OP = 1 OR OP = 4 OR OP = 5
       		ACCEPT OP LINE 10 COL 24
       		END-PERFORM
       		IF OP = 1 GO TO AGREGAR-REG.
       		IF OP = 5 GO TO FINALIZAR.
       		ACCEPT ARCH LINE 13 COL 38
       		PERFORM UNTIL ARCH = 3 OR ARCH = 2 OR ARCH = 1
       		ACCEPT ARCH LINE 13 COL 38
       		END-PERFORM
       		IF OP = 2 THEN
       		DISPLAY "INGRESE RUT A BUSCAR:        - " LINE 19 COL 2
       		ACCEPT RUT-ING LINE 19 COL 23
       		ACCEPT DV-I	LINE 19 COL 32
       		PERFORM VALIDA-RUT
       			IF DV-CALC NOT = DV-I
       			GO TO MENU-PRINCIPAL
       			END-IF
       		PERFORM BUSQUEDA THRU SALIR-BUSQUEDA
       		GO TO MENU-PRINCIPAL
       		END-IF
       		IF OP = 3 THEN
       		ACCEPT ORDD LINE 16 COL 34
       		PERFORM UNTIL ORDD = 2 OR ORDD = 1
       		ACCEPT ORDD LINE 16 COL 34
       		END-PERFORM
       		DISPLAY "INGRESE APELLIDO A LISTAR:" LINE 19 COL 2
       		ACCEPT APE-ING LINE 19 COL 28
       		PERFORM LISTAR-APE THRU SALIR-LISTAR2
       		GO TO MENU-PRINCIPAL
       		END-IF
       		IF OP = 4 THEN
       		ACCEPT ORDD LINE 16 COL 34
       		PERFORM UNTIL ORDD = 2 OR ORDD = 1
       		ACCEPT ORDD LINE 16 COL 34
       		END-PERFORM
       		DISPLAY "INGRESE RUT A LISTAR:        - " LINE 19 COL 2
       		ACCEPT RUT-ING LINE 19 COL 23
       		ACCEPT DV-I	LINE 19 COL 32
       		PERFORM VALIDA-RUT
       			IF DV-CALC NOT = DV-I
       			GO TO MENU-PRINCIPAL
       			END-IF
       		PERFORM LISTAR-RUT THRU SALIR-LISTAR1
       		GO TO MENU-PRINCIPAL
       		END-IF
       		GO TO MENU-PRINCIPAL.
       AGREGAR-REG.
       		DISPLAY SPACE LINE 1 COL 1 ERASE
       		DISPLAY "AGREGAR REGISTROS" LINE 2 COL 20
       		DISPLAY "RUT...............:        - " LINE 4 COL 2
       		DISPLAY "APELLIDO PAT......:" LINE 5 COL 2
       		DISPLAY "APELLIDO MAT......:" LINE 6 COL 2
       		DISPLAY "NOMBRES...........:" LINE 7 COL 2
       		DISPLAY "FECHA NACIMIENTO..:../../....(DD/MM/AAAA)"
       					LINE 8 COL 2
       		DISPLAY "SEXO (M/F)........:" LINE 9 COL 2.
       PIDERUT.
       		ACCEPT RUT-ING LINE 4 COL 21
       		ACCEPT DV-I	LINE 4 COL 30
       		PERFORM VALIDA-RUT.
       		IF DV-CALC NOT = DV-I GO TO PIDERUT.
       		MOVE RUT-ING TO RUT1
       		MOVE DV-I TO DV1
       		ACCEPT APELLIDOA1 LINE 5 COL 21
       		ACCEPT APELLIDOB1 LINE 6 COL 21
       		ACCEPT NOMBRE1 LINE 7 COL 21.
       PIDEFECHA.
       		PERFORM VALIDA-DIA THRU VALIDA-MES
       		MOVE DIAN TO DIA1
       		MOVE MESN TO MES1
       		ACCEPT ANO1 LINE 8 COL 27.
       PIDESEX.
       		ACCEPT SEXO1 LINE 9 COL 21.
       		IF SEXO1 NOT = "F" AND SEXO1 NOT = "f"
       		AND SEXO1 NOT = "M" AND SEXO1 NOT = "m" GO TO PIDESEX.
       GRABA-NUEVO.
       		MOVE RUTB1 TO RUT3
       		WRITE REG-NOM1
       		INVALID KEY
       		MOVE REG-NOM1 TO REG-NOM2
       			WRITE REG-NOM2 END-WRITE
       		END-WRITE.
       		DISPLAY "AGREGAR MAS REGISTROS (S/N):" LINE 20 COL 2.
       	    ACCEPT SN LINE 20 COL 30.
       		IF SN = "S" OR SN = "s" GO TO AGREGAR-REG
       		ELSE GO TO MENU-PRINCIPAL.
       FINALIZAR.
       		CLOSE NOMBRES1 NOMBRES2
       		STOP RUN.
       		
       VALIDA-RUT.
       		COMPUTE SUMA-RUT1 = R8 * 2 + R7 * 3 + R6 * 4 + R5 * 5.
       		COMPUTE SUMA-RUT2 = R4 * 6 + R3 * 7 + R2 * 2 + R1 * 3.
       		COMPUTE SUMA-RUT = SUMA-RUT1 + SUMA-RUT2.
       		COMPUTE RESULTADO-RUT = SUMA-RUT / 11.
       		COMPUTE MODULO-RUT = SUMA-RUT - (RESULTADO-RUT * 11).
       		COMPUTE MODULO-RESTA = 11 - MODULO-RUT.
       		IF MODULO-RESTA = 11 MOVE "0" TO DV-CALC.
       		IF MODULO-RESTA = 10 MOVE "K" TO DV-CALC.
       		IF MODULO-RESTA = 09 MOVE "9" TO DV-CALC.
       		IF MODULO-RESTA = 08 MOVE "8" TO DV-CALC.
       		IF MODULO-RESTA = 07 MOVE "7" TO DV-CALC.
       		IF MODULO-RESTA = 06 MOVE "6" TO DV-CALC.
    	   	IF MODULO-RESTA = 05 MOVE "5" TO DV-CALC.
	       	IF MODULO-RESTA = 04 MOVE "4" TO DV-CALC.
       		IF MODULO-RESTA = 03 MOVE "3" TO DV-CALC.
    	   	IF MODULO-RESTA = 02 MOVE "2" TO DV-CALC.
 	      	IF MODULO-RESTA = 01 MOVE "1" TO DV-CALC.
       VALIDA-DIA.
       		ACCEPT DIAN LINE 8 COL 21
       		IF DIAN > 31 OR DIAN < 1 GO TO VALIDA-DIA.
       VALIDA-MES.	
       		ACCEPT MESN LINE 8 POSITION 24
       		IF MESN > 12 OR MESN < 1 GO TO VALIDA-MES.
	    	IF DIAN > 28 AND MESN = 2 GO TO VALIDA-DIA.
	    	IF DIAN > 30
	    	AND (MESN = 4 OR MESN = 6 OR MESN = 9 OR MESN = 11)
	    	THEN GO TO VALIDA-DIA.
	   BUSQUEDA.
	   		PERFORM CERRAR2
	   		IF ARCH = 1 THEN
	   		SORT TEMPO
       		ON ASCENDING KEY RUT-TEMP
       		USING NOMBRES1
       		GIVING NOMBRES-ORD.
       		IF ARCH = 2 THEN
	   		SORT TEMPO
       		ON ASCENDING KEY RUT-TEMP
       		USING NOMBRES2
       		GIVING NOMBRES-ORD.
       		IF ARCH = 3 THEN
	   		SORT TEMPO
       		ON ASCENDING KEY RUT-TEMP
       		USING NOMBRES1 NOMBRES2
       		GIVING NOMBRES-ORD.
       		OPEN INPUT NOMBRES-ORD.
       BUSQUEDAB.
       		READ NOMBRES-ORD AT END 
       		DISPLAY "ERROR REGISTRO NO ENCONTRADO" LINE 20 COL 30
       		DISPLAY "CUALQUIER TECLA, MENU PRINCIPAL" LINE 22 COL 30
       		CLOSE NOMBRES-ORD
       		PERFORM ABRIR2
       		ACCEPT SN
       		GO TO MENU-PRINCIPAL.
       		IF RUT-ORD = RUT-ING THEN
       		DISPLAY SPACE LINE 1 COL 1 ERASE
       		DISPLAY "REGISTRO ENCONTRADO" LINE 2 COL 20
       		DISPLAY "RUT...............:        - " LINE 4 COL 2
       		DISPLAY "APELLIDO PAT......:" LINE 5 COL 2
       		DISPLAY "APELLIDO MAT......:" LINE 6 COL 2
       		DISPLAY "NOMBRES...........:" LINE 7 COL 2
       		DISPLAY "FECHA NACIMIENTO..:../../....(DD/MM/AAAA)"
       					LINE 8 COL 2
       		DISPLAY "SEXO (M/F)........:" LINE 9 COL 2
       		DISPLAY RUT-ORD LINE 4 COL 21
       		DISPLAY DV-ORD LINE 4 COL 30
       		DISPLAY APELLIDOA-ORD LINE 5 COL 21
       		DISPLAY APELLIDOB-ORD LINE 6 COL 21
       		DISPLAY NOMBRE-ORD LINE 7 COL 21
       		DISPLAY ANO-ORD LINE 8 COL 27
       		DISPLAY MES-ORD LINE 8 COL 24
       		DISPLAY DIA-ORD LINE 8 COL 21
       		DISPLAY SEXO-ORD LINE 9 COL 21       		
       		DISPLAY "PRESIONE CUALQUIER TECLA PARA VOLVER AL MENU"
       					LINE 11 COL 2
       		ACCEPT SN LINE 12 COL 2
       		CLOSE NOMBRES-ORD
       		PERFORM ABRIR2
       		GO TO MENU-PRINCIPAL
       		ELSE
       		GO TO BUSQUEDAB
       		END-IF.
       SALIR-BUSQUEDA.
       		EXIT.
       LISTAR-RUT.
       		PERFORM CERRAR2
	   		IF ORDD = 1 THEN
	   			IF ARCH = 1 THEN
	   			SORT TEMPO
       			ON ASCENDING KEY RUT-TEMP
       			USING NOMBRES1
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 2 THEN
	   			SORT TEMPO
       			ON ASCENDING KEY RUT-TEMP
       			USING NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 3 THEN
	   			SORT TEMPO
       			ON ASCENDING KEY RUT-TEMP
       			USING NOMBRES1 NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       		END-IF
       		IF ORDD = 2 THEN
       			IF ARCH = 1 THEN
	   			SORT TEMPO
       			ON DESCENDING KEY RUT-TEMP
       			USING NOMBRES1
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 2 THEN
	   			SORT TEMPO
       			ON DESCENDING KEY RUT-TEMP
       			USING NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 3 THEN
	   			SORT TEMPO
       			ON DESCENDING KEY RUT-TEMP
       			USING NOMBRES1 NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       		END-IF
       		OPEN INPUT NOMBRES-ORD.
       LISTAR-RUTB.
       		MOVE 6 TO INDICE
       		READ NOMBRES-ORD AT END 
       		DISPLAY "ERROR REGISTRO NO ENCONTRADO" LINE 20 COL 30
       		DISPLAY "CUALQUIER TECLA, MENU PRINCIPAL" LINE 22 COL 30
       		CLOSE NOMBRES-ORD
       		PERFORM ABRIR2
       		ACCEPT SN
       		GO TO MENU-PRINCIPAL.
       		IF RUT-ORD = RUT-ING THEN
       		DISPLAY SPACE LINE 1 COL 1 ERASE
       		DISPLAY "REGISTRO ENCONTRADO" LINE 2 COL 20
       		DISPLAY "RUT" LINE 4 COL 2
       		DISPLAY "APELLIDO PAT" LINE 4 COL 13
       		DISPLAY "NOMBRES" LINE 4 COL 26
       		DISPLAY "FECHA NAC(DD/MM/AAAA)" LINE 4 COL 44
       		DISPLAY "SEXO" LINE 4 COL 66
       		DISPLAY "-" LINE INDICE COL 10
       		DISPLAY RUT-ORD LINE INDICE COL 2
       		DISPLAY DV-ORD LINE INDICE COL 11
       		DISPLAY APELLIDOA-ORD LINE INDICE COL 13
       		DISPLAY NOMBRE-ORD LINE INDICE COL 26
       		DISPLAY "  /  /    " LINE INDICE COL 44
       		DISPLAY ANO-ORD LINE INDICE COL 50
       		DISPLAY MES-ORD LINE INDICE COL 47
       		DISPLAY DIA-ORD LINE INDICE COL 44
       		DISPLAY SEXO-ORD LINE INDICE COL 66
       		DISPLAY "PARA EL SIGUIE. REG. PRESIONE (S)" LINE 11 COL 2
       		DISPLAY "PARA SALIR PRESIONE (N)" LINE 12 COL 2
       		ACCEPT SN LINE 12 COL 2
       			IF SN = "N" OR SN = "n" THEN
       			CLOSE NOMBRES-ORD
       			PERFORM ABRIR2
       			GO TO MENU-PRINCIPAL
       			END-IF
       		DISPLAY "                                 " LINE 11 COL 2
       		DISPLAY "                                 " LINE 12 COL 2
       		PERFORM LEER-SIGUIENTE THRU LEER-SALIR
       		ELSE
       		GO TO LISTAR-RUTB
       		END-IF.
       SALIR-LISTAR1.
       		EXIT.
       LISTAR-APE.
       		PERFORM CERRAR2
	   		IF ORDD = 1 THEN
	   			IF ARCH = 1 THEN
	   			SORT TEMPO
       			ON ASCENDING KEY APELLIDOA-TEMP
       			USING NOMBRES1
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 2 THEN
	   			SORT TEMPO
       			ON ASCENDING KEY APELLIDOA-TEMP
       			USING NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 3 THEN
	   			SORT TEMPO
       			ON ASCENDING KEY APELLIDOA-TEMP
       			USING NOMBRES1 NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       		END-IF
       		IF ORDD = 2 THEN
       			IF ARCH = 1 THEN
	   			SORT TEMPO
       			ON DESCENDING KEY APELLIDOA-TEMP
       			USING NOMBRES1
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 2 THEN
	   			SORT TEMPO
       			ON DESCENDING KEY APELLIDOA-TEMP
       			USING NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       			IF ARCH = 3 THEN
	   			SORT TEMPO
       			ON DESCENDING KEY APELLIDOA-TEMP
       			USING NOMBRES1 NOMBRES2
       			GIVING NOMBRES-ORD
       			END-IF
       		END-IF
       		OPEN INPUT NOMBRES-ORD.
       LISTAR-APEB.
       		MOVE 6 TO INDICE
       		READ NOMBRES-ORD AT END
       		DISPLAY "ERROR REGISTRO NO ENCONTRADO" LINE 20 COL 30
       		DISPLAY "CUALQUIER TECLA, MENU PRINCIPAL" LINE 22 COL 30
       		CLOSE NOMBRES-ORD
       		PERFORM ABRIR2
       		ACCEPT SN
       		GO TO MENU-PRINCIPAL.
       		IF APELLIDOA-ORD = APE-ING THEN
       		DISPLAY SPACE LINE 1 COL 1 ERASE
       		DISPLAY "REGISTRO ENCONTRADO" LINE 2 COL 20
       		DISPLAY "RUT" LINE 4 COL 2
       		DISPLAY "APELLIDO PAT" LINE 4 COL 13
       		DISPLAY "NOMBRES" LINE 4 COL 26
       		DISPLAY "FECHA NAC(DD/MM/AAAA)" LINE 4 COL 44
       		DISPLAY "SEXO" LINE 4 COL 66
       		DISPLAY "-" LINE INDICE COL 10
       		DISPLAY RUT-ORD LINE INDICE COL 2
       		DISPLAY DV-ORD LINE INDICE COL 11
       		DISPLAY APELLIDOA-ORD LINE INDICE COL 13
       		DISPLAY NOMBRE-ORD LINE INDICE COL 26
       		DISPLAY "  /  /    " LINE INDICE COL 44
       		DISPLAY ANO-ORD LINE INDICE COL 50
       		DISPLAY MES-ORD LINE INDICE COL 47
       		DISPLAY DIA-ORD LINE INDICE COL 44
       		DISPLAY SEXO-ORD LINE INDICE COL 66
       		DISPLAY "PARA EL SIGUIE. REG. PRESIONE (S)" LINE 11 COL 2
       		DISPLAY "PARA SALIR PRESIONE (N)" LINE 12 COL 2
       		ACCEPT SN LINE 12 COL 2
       			IF SN = "N" OR SN = "n" THEN
       			CLOSE NOMBRES-ORD
       			PERFORM ABRIR2
       			GO TO MENU-PRINCIPAL
       			END-IF
       		DISPLAY "                                 " LINE 11 COL 2
       		DISPLAY "                                 " LINE 12 COL 2
       		PERFORM LEER-SIGUIENTE THRU LEER-SALIR
       		ELSE
       		GO TO LISTAR-APEB
       		END-IF.
       SALIR-LISTAR2.
       		EXIT.
       LEER-SIGUIENTE.
       		ADD 1 TO INDICE
       		READ NOMBRES-ORD AT END
       		DISPLAY "FIN DE ARCHIVO" LINE 20 COL 30
       		DISPLAY "CUALQUIER TECLA, MENU PRINCIPAL" LINE 22 COL 30
       		CLOSE NOMBRES-ORD
       		PERFORM ABRIR2
       		ACCEPT SN
       		GO TO MENU-PRINCIPAL.
       		DISPLAY "-" LINE INDICE COL 10
       		DISPLAY RUT-ORD LINE INDICE COL 2
       		DISPLAY DV-ORD LINE INDICE COL 11
       		DISPLAY APELLIDOA-ORD LINE INDICE COL 13
       		DISPLAY NOMBRE-ORD LINE INDICE COL 26
       		DISPLAY "  /  /    " LINE INDICE COL 44
       		DISPLAY ANO-ORD LINE INDICE COL 50
       		DISPLAY MES-ORD LINE INDICE COL 47
       		DISPLAY DIA-ORD LINE INDICE COL 44
       		DISPLAY SEXO-ORD LINE INDICE COL 66
       		ACCEPT SN LINE 1 COL 1
       			IF SN = "N" OR SN = "n" THEN
       			CLOSE NOMBRES-ORD
       			PERFORM ABRIR2
       			GO TO MENU-PRINCIPAL
       			END-IF
       		GO TO LEER-SIGUIENTE.
       LEER-SALIR.
       		EXIT.
       ABRIR2.
       		OPEN EXTEND NOMBRES2
       		OPEN I-O NOMBRES1.
       CERRAR2.
       		CLOSE NOMBRES2 NOMBRES1.
