       IDENTIFICATION DIVISION.
       PROGRAM-ID. TAREA3.
       AUTHOR. DIEGO-BARRERA-MUÑOZ.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 NOM-DEC.
       	02 DECENAS OCCURS 9 TIMES.
       		03 NOM-DECENA	PIC X(10) VALUE SPACES.
       		03 NOM-DECENAS	PIC X(10) VALUE SPACES.
       
       01 NOM-UNII.
       	02 UNIDADES OCCURS 19 TIMES.
       	03 NOM-UNIDADES	PIC X(10) VALUE SPACES.
       
       01 NOM-MILL.
        02 MILLONESS OCCURS 4 TIMES.
       	03 NOM-MILLONES	PIC X(20) VALUE SPACES.
       	03 NOM-MILLON	PIC X(20) VALUE SPACES.
       
       01 AGRE-NUM-ALFA PIC X(30) JUSTIFIED RIGHT.
       01 CAMBIO.
       	02 V-CAMBIO OCCURS 11 TIMES.
       		03 MONEDAS		PIC 9(5).
       		03 ACUM			PIC 9(2).
       		03 MONEDAS-N	PIC X(5).
       01 NUM-TABLA.
       	02 PERIODO OCCURS 5 TIMES.
       		03 MILLARES OCCURS 2 TIMES.
       			04 DIGITOS OCCURS 3 TIMES.
       				05 DIGITO PIC 9 VALUE 0.
       01 NUM-TABLA-ALFA REDEFINES NUM-TABLA PIC X(30).
       77 TOTAL-PAGAR	PIC 9(10) VALUE 0.
       77 PAGAR-CON		PIC 9(10) VALUE 0.
       77 DIFERENCIA	PIC 9(10) VALUE 0.
       77 RESTO			PIC 9 VALUE 0.
       77 I				PIC 9 VALUE 1.
       77 X				PIC 9 VALUE 1.
       77 Y				PIC 9 VALUE 1.
       77 R				PIC 99 VALUE 1.
       77 J				PIC 99 VALUE 10.
       77 CADENA		PIC X(30).
       77 VAR			PIC 99 VALUE 0.
       77 SN			PIC X.
       77 CA			PIC X(90).
       77 MONEDAX		PIC 9(5).
       PROCEDURE DIVISION.
       NOMBRAR.
       		MOVE 1 TO R
       		MOVE 10 TO J
       		MOVE ALL ZEROES TO CAMBIO
       		MOVE "20000" TO MONEDAS-N(1).
       		MOVE "10000" TO MONEDAS-N(2).
       		MOVE " 5000" TO MONEDAS-N(3).
       		MOVE " 2000" TO MONEDAS-N(4).
       		MOVE " 1000" TO MONEDAS-N(5).
       		MOVE "  500" TO MONEDAS-N(6).
       		MOVE "  100" TO MONEDAS-N(7).
       		MOVE "   50" TO MONEDAS-N(8).
       		MOVE "   10" TO MONEDAS-N(9).
       		MOVE "    5" TO MONEDAS-N(10).
       		MOVE "    1" TO MONEDAS-N(11).
       		ADD 20000 TO MONEDAS(1).
       		ADD 10000 TO MONEDAS(2).
       		ADD 5000 TO MONEDAS(3).
       		ADD 2000 TO MONEDAS(4).
       		ADD 1000 TO MONEDAS(5).
       		ADD 500 TO MONEDAS(6).
       		ADD 100 TO MONEDAS(7).
       		ADD 50 TO MONEDAS(8).
       		ADD 10 TO MONEDAS(9).
       		ADD 5 TO MONEDAS(10).
       		ADD 1 TO MONEDAS(11).
       		MOVE "UN MILLON" TO NOM-MILLON(4).
       		MOVE "MILLONES" TO NOM-MILLONES(4).
       		MOVE "UNO" TO NOM-UNIDADES(1).
       		MOVE "DOS" TO NOM-UNIDADES(2).
       		MOVE "TRES" TO NOM-UNIDADES(3).
       		MOVE "CUATRO" TO NOM-UNIDADES(4).
       		MOVE "CINCO" TO NOM-UNIDADES(5).
       		MOVE "SEIS" TO NOM-UNIDADES(6).
       		MOVE "SIETE" TO NOM-UNIDADES(7).
       		MOVE "OCHO" TO NOM-UNIDADES(8).
       		MOVE "NUEVE" TO NOM-UNIDADES(9).
       		MOVE "DIEZ" TO NOM-UNIDADES(10).
       		MOVE "ONCE" TO NOM-UNIDADES(11).
       		MOVE "DOCE" TO NOM-UNIDADES(12).
       		MOVE "TRECE" TO NOM-UNIDADES(13).
       		MOVE "CATORCE" TO NOM-UNIDADES(14).
       		MOVE "QUINCE" TO NOM-UNIDADES(15).
       		MOVE "DIECISEIS" TO NOM-UNIDADES(16).
       		MOVE "DIECISIETE" TO NOM-UNIDADES(17).
       		MOVE "DIECIOCHO" TO NOM-UNIDADES(18).
       		MOVE "DIECINUEVE" TO NOM-UNIDADES(19).
       		MOVE "VEINTE" TO NOM-DECENA(2).
       		MOVE "TREINTA" TO NOM-DECENA(3).
       		MOVE "CUARENTA" TO NOM-DECENA(4).
       		MOVE "CINCUENTA" TO NOM-DECENA(5).
       		MOVE "SESENTA" TO NOM-DECENA(6).
       		MOVE "SETENTA" TO NOM-DECENA(7).
       		MOVE "OCHENTA" TO NOM-DECENA(8).
       		MOVE "NOVENTA" TO NOM-DECENA(9).
       		MOVE "VEINTI" TO NOM-DECENAS(2).
       		MOVE "TREINTI" TO NOM-DECENAS(3).
       		MOVE "CUARENTI" TO NOM-DECENAS(4).
       		MOVE "CINCUENTI" TO NOM-DECENAS(5).
       		MOVE "SESENTI" TO NOM-DECENAS(6).
       		MOVE "SETENTI" TO NOM-DECENAS(7).
       		MOVE "OCHENTI" TO NOM-DECENAS(8).
       		MOVE "NOVENTI" TO NOM-DECENAS(9).
       LEER-PANTALLA.
       		DISPLAY SPACE LINE 1 COL 1 ERASE.
       		DISPLAY "PROGRAMA CAJERO" LINE 2 COL 30.
       		DISPLAY "TOTAL A CANCELAR__:" LINE 4 COL 2.
       		ACCEPT TOTAL-PAGAR LINE 4 COL 21.
       		MOVE TOTAL-PAGAR TO AGRE-NUM-ALFA
       		MOVE AGRE-NUM-ALFA TO NUM-TABLA-ALFA
       		PERFORM RECORRE-MATRIZ THRU SALIR-RECO.
       		DISPLAY "PAGAR CON_________:" LINE 5 COL 2.
       		ACCEPT PAGAR-CON LINE 5 COL 21.
       		MOVE PAGAR-CON TO AGRE-NUM-ALFA
       		MOVE AGRE-NUM-ALFA TO NUM-TABLA-ALFA
       		PERFORM RECORRE-MATRIZ THRU SALIR-RECO.
       		ACCEPT SN
       		IF PAGAR-CON > TOTAL-PAGAR THEN
       		COMPUTE DIFERENCIA = PAGAR-CON - TOTAL-PAGAR
       		DISPLAY "EL CAMBIO ES______:" LINE 6 COL 2
       		MOVE DIFERENCIA TO AGRE-NUM-ALFA
       		DISPLAY DIFERENCIA LINE 6 COL 21
       		MOVE AGRE-NUM-ALFA TO NUM-TABLA-ALFA
       		PERFORM RECORRE-MATRIZ THRU SALIR-RECO
       		PERFORM FUNCION THRU FIN-FUNCION
       		MOVE 1 TO R
       		PERFORM UNTIL R > 11
       			DISPLAY MONEDAS-N(R) LINE J COL 2
       			DISPLAY ACUM(R) LINE J COL 18
       			ADD 1 TO J
       			ADD 1 TO R
       		END-PERFORM
       		ELSE GO TO LEER-PANTALLA END-IF.
       FIN-PROGRAMA.
       		DISPLAY "CONTINUAR(S/N):" LINE 15 COL 30
       		ACCEPT SN LINE 15 COL 45
       		IF SN = "S" OR SN = "s" GO TO NOMBRAR.
       		STOP RUN.
       RECORRE-MATRIZ.
       		PERFORM UNTIL I > 5
       			PERFORM UNTIL X > 2
       				PERFORM UNTIL Y > 3
       				IF DIGITO(I, X, Y) NOT = " " THEN
       					PERFORM VALIDAR THRU SALIR
       				END-IF
       				ADD 1 TO Y
       				END-PERFORM
       			ADD 1 TO X
       			MOVE 1 TO Y
       			END-PERFORM
       		ADD 1 TO I
       		MOVE 1 TO X
       		END-PERFORM.
       		MOVE ALL SPACES TO CA
       		MOVE 1 TO I
       		MOVE 1 TO X
       		MOVE 1 TO Y.
       SALIR-RECO.
       		EXIT.
       VALIDAR.
       		IF Y = 3
       		IF DIGITO(I, X, Y) > 0 AND DIGITO(I, X, 2) NOT = 1
       		IF DIGITO(I, X, Y) = 1 AND X = 1 OR I = 4 AND
       		DIGITO(I, X, 2) = 0 AND DIGITO(I, X, 1) = 0 THEN
       		GO TO MILESS
       		ELSE
       		MOVE DIGITO(I, X, Y) TO VAR
       		MOVE NOM-UNIDADES(VAR) TO CADENA
       		STRING CA CADENA DELIMITED BY SPACE INTO CA
       		END-IF
       		END-IF
       		ELSE IF Y = 1 THEN
       		IF DIGITO(I, X, Y) = 5 THEN
       		STRING CA "QUINIENTOS" DELIMITED BY SPACE INTO CA
       		ELSE IF DIGITO(I, X, Y) = 9
       		STRING CA "NOVECIENTOS" DELIMITED BY SPACE INTO CA
       		ELSE IF DIGITO(I, X, Y) = 1 AND
       		DIGITO(I, X, 2) = 0 AND DIGITO(I, X, 3) = 0 THEN
       		STRING CA "CIEN" DELIMITED BY SPACE INTO CA
       		ELSE IF DIGITO(I, X, Y) = 1
       		STRING CA "CIENTO" DELIMITED BY SPACE INTO CA
       		ELSE IF DIGITO(I, X, Y) > 1
       		MOVE DIGITO(I, X, Y) TO VAR
       		MOVE NOM-UNIDADES(VAR) TO CADENA
       		STRING CA CADENA "CIENTOS" DELIMITED BY SPACE INTO CA
       		END-IF
       		
       		ELSE IF Y = 2
       		IF DIGITO(I, X, 3) = 0 THEN
       		IF DIGITO(I, X, Y) = 1
       		MOVE NOM-UNIDADES(10) TO CADENA
       		STRING CA CADENA DELIMITED BY SPACE INTO CA
       		ELSE IF DIGITO(I, X, Y) > 1
       		MOVE DIGITO(I, X, Y) TO VAR
       		MOVE NOM-DECENA(VAR) TO CADENA
       		STRING CA CADENA DELIMITED BY SPACE INTO CA
       		END-IF
       		
       		ELSE IF DIGITO(I, X, 3) NOT = 0
       		IF DIGITO(I, X, Y) = 1
       		MOVE DIGITO(I, X, 3) TO VAR
       		ADD 10 TO VAR
       		MOVE NOM-UNIDADES(VAR) TO CADENA
       		STRING CA CADENA DELIMITED BY SPACE INTO CA
       		ELSE IF DIGITO(I, X, Y) > 1
       		MOVE DIGITO(I, X, Y) TO VAR
       		MOVE NOM-DECENAS(VAR) TO CADENA
       		STRING CA CADENA DELIMITED BY SPACE INTO CA
       		END-IF
       		END-IF
       		END-IF.
       MILESS.
       		IF X = 1 AND Y = 3 THEN
       		IF DIGITO(I, X, Y) > 0 OR
       		DIGITO(I, X, 2) > 0 OR DIGITO(I, X, 1) > 0 THEN
       		STRING CA "MIL" DELIMITED BY SPACE INTO CA
       		END-IF
       		END-IF.
       		IF X = 2 AND Y = 3 AND I NOT = 5 THEN
       		IF DIGITO(I, X, Y) = 1 AND DIGITO(I, X, 2) = 0 AND 
       		DIGITO(I, X, 1) = 0 THEN
       		MOVE I TO VAR 
       		MOVE NOM-MILLON(VAR) TO CADENA
       		STRING CA "UN" SPACE "MILLON" DELIMITED BY SPACE INTO CA
       		ELSE IF DIGITO(I, X, 2) NOT = 0 OR
       			DIGITO(I, X, 1) NOT = 0 OR DIGITO(I, X, Y) NOT = 0
       		STRING CA "MILLONES" DELIMITED BY SPACE INTO CA
       		END-IF
       		END-IF.
       		DISPLAY CA LINE 8 COL 1.
       SALIR.
       		EXIT.
       FUNCION.
       		PERFORM UNTIL R > 11
       			MOVE MONEDAS(R) TO MONEDAX
       			COMPUTE RESTO = DIFERENCIA / MONEDAX
       			IF RESTO >= 1 THEN
       			COMPUTE DIFERENCIA = DIFERENCIA - (RESTO * MONEDAX)
       			MOVE RESTO TO ACUM(R)
       			END-IF
       			ADD 1 TO R
       		END-PERFORM.
       FIN-FUNCION.
       		EXIT.
